from config.public import *

start_and_welcom = 'سلام\n به بات *{}* خوش آمدید. برای شروع از کلید زیر استفاده نمایید.'.format(channel_name)
admin_menu = 'مدیر محترم لطفا از گزینه های زیر برای مدیریت ربات استفاده نمایید.'
user_menu = 'شما می‌‌توانید برای ادامه از گزینه‌های زیر انتخاب نمایید.'
get_prd_id = 'لطفا شناسه محصول مورد نظر خود را ارسال نمایید.'
get_count = 'لطفا تعداد خرید از این محصول را وارد نمایید.'
cancel = 'عملیات لغو شد.'
bad_input = 'لطفا ورودی مناسب ارسال نمایید.'
get_prd_name = 'لطفا نام محصول را وارد نمایید.'
get_prd_amount = 'لطفا قیمت محصول را وارد نمایید.'
get_prd_photo = 'لطفا تصویر محصول را وارد نمایید.'
get_prd_done = 'افزودن محصول با موفقیت به اتمام رسید.'
payment_done = 'پرداخت شما با موفقیت انجام شد.\n شناسه خرید برای شما ارسال خواهد شد.(بمنظور راحتی در گرفتن رونوشت از ' \
               'شناسه، به صورت * _مجزا_ * ارسال می‌شود.) \n\n\n\n_«شناسه خرید خود را، بمنظور *مشاهده وضعیت ' \
               'درخواست‌ها* ' \
               'نگهداری کنید.»_'
prd_not_exist = 'محصولی با این شناسه یافت نشد. لطفا دوباره تلاش نمایید...'
req_not_exist = 'درخواستی با این شناسه یافت نشد. لطفا دوباره تلاش نمایید...'
get_request_id = 'لطفا شناسه خرید خود را وارد نمایید.'
send_request_state = 'درخواست شما در وضعیت *«{}»* می‌باشد.'
ruls = 'قانون هایی که دارید اینجا ذکر میشه. مهمترین چیز اینه که مثلا برای پرداخت باید حتما مشخصات توی توضیحات پرداخت ' \
       'ذکر بشه. '
author = 'نویسنده بات: @ad_newD'
bio = 'اینجا درباره کانال و فروشگاه یه توضیحات و بیوگرافی می‌تونید بنویسید. \n\n\n\n {}'.format(author)

continue_btn = 'ادامه'
ruls_btn = 'قوانین'
bio_btn = 'درباره'
sales_report_btn = 'گذارش فروش'
buy_btn = 'خرید'
insert_product_btn = 'افزودن محصول جدید'
cancel_btn = 'انصراف'
state_view_btn = 'مشاهده وضعیت خرید'

offer_number = 'تعداد سفارش'
unit_price = 'قیمت واحد'
prd_id = 'شناسه محصول'
